base_categories = {'ремонт':40000,
                    'кредит':50000,
                    'комуналка':12000,
                    'проезд сиги':12000,
                    'питание':25000,
                    'рестораны':16000,
                    'доставка':6000,
                    'здоровье':17000,
                    'бьюти хуюти':12000,
                    'камила':20000,
                    'eгор':20000,
                    'доп росходы': 10000,
                    'техника': 10000 
                   }

sum = 0
for i in base_categories:
    a = base_categories[i]
    sum += a
print(sum)